Autodesk.Revit.DB.BuiltInFailures.SelectionFailures.NoValidElementSelected
No valid element selected.

Autodesk.Revit.DB.BuiltInFailures.SelectionFailures.NoElementSelected
No element selected.

Autodesk.Revit.DB.BuiltInFailures.SelectionFailures
Failures about Selections.